baseCases/baseVortex/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0.00 0.00 0.00) //0
    (0.10 0.00 0.00) //1
    (0.10 0.10 0.00) //2
    (0.00 0.10 0.00) //3
    (0.00 0.00 0.05) //4
    (0.10 0.00 0.05) //5
    (0.10 0.10 0.05) //6
    (0.00 0.10 0.05) //7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (mx my mz) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 5 6 2)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (0 1 5 4)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (3 2 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
