baseCases/baseVortex/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

swirl
{
    type vectorSwakSetValue;

    active true;
    timeStart 0;
    duration 1;
    selectionMode all;

    vectorSwakSetValueCoeffs {
        useMaskExpression true;
        maskExpression "mag(pos()-center)<radius";

        variables (
            "speed=xx;"
            "center=vector(0.02,0.05,pos().z);"
            "radius=x.xx;"
        );

        expressions {
            U "vector(0,0,speed)^(pos()-center)" [0 1 -1 0 0 0 0];
        }
    }
}


// ************************************************************************* //
